701Enti/SEVETEST30/sdkconfig.defaults
#
# Serial flasher config
#
# CONFIG_ESPTOOLPY_NO_STUB is not set
# CONFIG_ESPTOOLPY_OCT_FLASH is not set
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=y
# CONFIG_ESPTOOLPY_FLASHMODE_QIO is not set
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"
# CONFIG_ESPTOOLPY_FLASHFREQ_120M is not set
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# CONFIG_ESPTOOLPY_FLASHFREQ_40M is not set
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_8MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE is not set
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
CONFIG_ESPTOOLPY_BEFORE="default_reset"
CONFIG_ESPTOOLPY_AFTER_RESET=y
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
CONFIG_ESPTOOLPY_AFTER="hard_reset"
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
# end of Serial flasher config

#
# Partition Table
#
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# CONFIG_PARTITION_TABLE_TWO_OTA_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table

#
# sevetest30 Configuration
#
CONFIG_WIFI_SSID=""
CONFIG_WIFI_PASSWORD=""
CONFIG_LOCAL_TZ="CST-8"
CONFIG_NTP_SERVER_0="ntp.aliyun.com"
CONFIG_NTP_SERVER_1="time.cloudflare.com"
CONFIG_NTP_SERVER_2="time.google.com"
CONFIG_DNS_SERVER="223.5.5.5"
CONFIG_BAIDU_API_ACCESS_API_KEY=""
CONFIG_BAIDU_API_ACCESS_SECRET_KEY=""
CONFIG_GPT_CHAT_ACCESS_KEY=""
CONFIG_IP138_IP_LOOKUP_TOKEN=""
CONFIG_QWEATHER_API_HOST=""
CONFIG_QWEATHER_API_JWT_PRIVATE_KEY_WITHOUT_HEADER_FOOTER=""
CONFIG_QWEATHER_API_JWT_CREDENTIAL_ID=""
CONFIG_QWEATHER_API_JWT_PROJECT_ID=""
CONFIG_AMAP_API_KEY=""
CONFIG_HIGH_TEMP=40
CONFIG_LOW_TEMP=12
CONFIG_COMFORT_TEMP=26
CONFIG_PUBLIC_DIVISOR=20
# end of sevetest30 Configuration

#
# Audio HAL
#
# CONFIG_AUDIO_BOARD_CUSTOM is not set
# CONFIG_ESP_LYRAT_V4_3_BOARD is not set
# CONFIG_ESP_LYRAT_V4_2_BOARD is not set
# CONFIG_ESP_LYRATD_MSC_V2_1_BOARD is not set
# CONFIG_ESP_LYRATD_MSC_V2_2_BOARD is not set
# CONFIG_ESP_LYRAT_MINI_V1_1_BOARD is not set
# CONFIG_ESP32_KORVO_DU1906_BOARD is not set
# CONFIG_ESP32_S2_KALUGA_1_V1_2_BOARD is not set
# CONFIG_ESP32_S3_KORVO2_V3_BOARD is not set
# CONFIG_ESP32_S3_KORVO2L_V1_BOARD is not set
# CONFIG_ESP32_S3_BOX_LITE_BOARD is not set
# CONFIG_ESP32_S3_BOX_BOARD is not set
# CONFIG_ESP32_S3_BOX_3_BOARD is not set
# CONFIG_M5STACK_ATOMS3R_BOARD is not set
# CONFIG_ESP32_C3_LYRA_V2_BOARD is not set
# CONFIG_ESP32_C6_DEVKIT_BOARD is not set
# CONFIG_ESP32_P4_FUNCTION_EV_BOARD is not set
# CONFIG_ESP32_P4_FUNCTION_EV_SUB_BOARD is not set
CONFIG_SEVETEST30_BOARD=y
# end of Audio HAL

#
# ADF Library Configuration
#
CONFIG_MEDIA_PROTOCOL_LIB_ENABLE=y
CONFIG_MEDIA_LIB_CRYPT_ENABLE=y
CONFIG_MEDIA_LIB_SOCKET_ENABLE=y
CONFIG_MEDIA_LIB_TLS_ENABLE=y
CONFIG_MEDIA_LIB_NETIF_ENABLE=y
# CONFIG_MEDIA_LIB_MEM_AUTO_TRACE is not set
# end of ADF Library Configuration

#
# ESP Speech Recognition
#
CONFIG_MODEL_IN_FLASH=y
# CONFIG_MODEL_IN_SDCARD is not set
CONFIG_AFE_INTERFACE_V1=y
CONFIG_SR_NSN_WEBRTC=y
# CONFIG_SR_NSN_NSNET2 is not set
CONFIG_SR_VADN_WEBRTC=y
# CONFIG_SR_VADN_VADNET1_MEDIUM is not set

#
# Load Multiple Wake Words (WakeNet9s)
#
# CONFIG_SR_WN_WN9S_HILEXIN is not set
# CONFIG_SR_WN_WN9S_HIESP is not set
# CONFIG_SR_WN_WN9S_NIHAOXIAOZHI is not set
# CONFIG_SR_WN_WN9S_HIJASON is not set
# end of Load Multiple Wake Words (WakeNet9s)

#
# Load Multiple Wake Words (WakeNet9)
#
# CONFIG_SR_WN_WN9_HILEXIN is not set
# CONFIG_SR_WN_WN9_NIHAOMIAOBAN_TTS2 is not set
# CONFIG_SR_WN_WN9_XIAOAITONGXUE is not set
# CONFIG_SR_WN_WN9_NIHAOXIAOZHI_TTS is not set
# CONFIG_SR_WN_WN9_ALEXA is not set
# CONFIG_SR_WN_WN9_HIESP is not set
# CONFIG_SR_WN_WN9_JARVIS_TTS is not set
# CONFIG_SR_WN_WN9_COMPUTER_TTS is not set
# CONFIG_SR_WN_WN9_HEYWILLOW_TTS is not set
# CONFIG_SR_WN_WN9_HIMFIVE is not set
# CONFIG_SR_WN_WN9_SOPHIA_TTS is not set
# CONFIG_SR_WN_WN9_HEYWANDA_TTS is not set
# CONFIG_SR_WN_WN9_HIJOLLY_TTS2 is not set
# CONFIG_SR_WN_WN9_HIFAIRY_TTS2 is not set
# CONFIG_SR_WN_WN9_HEYPRINTER_TTS is not set
# CONFIG_SR_WN_WN9_MYCROFT_TTS is not set
# CONFIG_SR_WN_WN9_HIJOY_TTS is not set
# CONFIG_SR_WN_WN9_HIJASON_TTS2 is not set
# CONFIG_SR_WN_WN9_ASTROLABE_TTS is not set
# CONFIG_SR_WN_WN9_HEYILY_TTS2 is not set
# CONFIG_SR_WN_WN9_BLUECHIP_TTS2 is not set
# CONFIG_SR_WN_WN9_XIAOLONGXIAOLONG_TTS is not set
# CONFIG_SR_WN_WN9_HIMIAOMIAO_TTS is not set
# CONFIG_SR_WN_WN9_MIAOMIAOTONGXUE_TTS is not set
# CONFIG_SR_WN_WN9_NIHAOXIAOXIN_TTS is not set
# CONFIG_SR_WN_WN9_XIAOMEITONGXUE_TTS is not set
# CONFIG_SR_WN_WN9_HILILI_TTS is not set
# CONFIG_SR_WN_WN9_HITELLY_TTS is not set
# CONFIG_SR_WN_WN9_XIAOBINXIAOBIN_TTS is not set
# CONFIG_SR_WN_WN9_HAIXIAOWU_TTS is not set
# CONFIG_SR_WN_WN9_XIAOYAXIAOYA_TTS2 is not set
# CONFIG_SR_WN_WN9_LINAIBAN_TTS2 is not set
# CONFIG_SR_WN_WN9_XIAOSUROU_TTS2 is not set
# CONFIG_SR_WN_WN9_XIAOYUTONGXUE_TTS2 is not set
# CONFIG_SR_WN_WN9_XIAOMINGTONGXUE_TTS2 is not set
# CONFIG_SR_WN_WN9_XIAOKANGTONGXUE_TTS2 is not set
# CONFIG_SR_WN_WN9_XIAOJIANXIAOJIAN_TTS2 is not set
# CONFIG_SR_WN_WN9_XIAOTEXIAOTE_TTS2 is not set
# CONFIG_SR_WN_WN9_NIHAOXIAOYI_TTS2 is not set
# CONFIG_SR_WN_WN9_NIHAOBAIYING_TTS2 is not set
# CONFIG_SR_WN_WN9_NIHAODONGDONG_TTS2 is not set
# CONFIG_SR_WN_WN9_HIWALLE_TTS2 is not set
# CONFIG_SR_WN_WN9_XIAOLUXIAOLU_TTS2 is not set
# CONFIG_SR_WN_WN9_NIHAOXIAOAN_TTS2 is not set
# end of Load Multiple Wake Words (WakeNet9)

CONFIG_SR_MN_CN_NONE=y
# CONFIG_SR_MN_CN_MULTINET5_RECOGNITION_QUANT8 is not set
# CONFIG_SR_MN_CN_MULTINET6_QUANT is not set
# CONFIG_SR_MN_CN_MULTINET6_AC_QUANT is not set
# CONFIG_SR_MN_CN_MULTINET7_QUANT is not set
# CONFIG_SR_MN_CN_MULTINET7_AC_QUANT is not set
CONFIG_SR_MN_EN_NONE=y
# CONFIG_SR_MN_EN_MULTINET5_SINGLE_RECOGNITION_QUANT8 is not set
# CONFIG_SR_MN_EN_MULTINET6_QUANT is not set
# CONFIG_SR_MN_EN_MULTINET7_QUANT is not set
# end of ESP Speech Recognition

#
# ADF Features
#
CONFIG_ESP_DISPATCHER_DELEGATE_TASK_CORE=0
CONFIG_ESP_DISPATCHER_DELEGATE_TASK_PRIO=10
CONFIG_ESP_DISPATCHER_DELEGATE_STACK_SIZE=4096
# end of ADF Features

#
# Compiler options
#
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
# CONFIG_COMPILER_OPTIMIZATION_PERF is not set
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT is not set
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE is not set
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=y
CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
CONFIG_COMPILER_HIDE_PATHS_MACROS=y
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# CONFIG_COMPILER_CXX_RTTI is not set
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
# CONFIG_COMPILER_STACK_CHECK_MODE_NORM is not set
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
# CONFIG_COMPILER_NO_MERGE_CONSTANTS is not set
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
# CONFIG_COMPILER_DISABLE_GCC12_WARNINGS is not set
# CONFIG_COMPILER_DISABLE_GCC13_WARNINGS is not set
# CONFIG_COMPILER_DISABLE_GCC14_WARNINGS is not set
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
CONFIG_COMPILER_RT_LIB_GCCLIB=y
CONFIG_COMPILER_RT_LIB_NAME="gcc"
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
# CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE is not set
# CONFIG_COMPILER_STATIC_ANALYZER is not set
# end of Compiler options

#
# Component config
#

#
# Application Level Tracing
#
# CONFIG_APPTRACE_DEST_JTAG is not set
CONFIG_APPTRACE_DEST_NONE=y
# CONFIG_APPTRACE_DEST_UART0 is not set
# CONFIG_APPTRACE_DEST_UART1 is not set
# CONFIG_APPTRACE_DEST_UART2 is not set
# CONFIG_APPTRACE_DEST_USB_CDC is not set
CONFIG_APPTRACE_DEST_UART_NONE=y
CONFIG_APPTRACE_UART_TASK_PRIO=1
CONFIG_APPTRACE_LOCK_ENABLE=y
# end of Application Level Tracing

#
# Bluetooth
#
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
# CONFIG_BT_NIMBLE_ENABLED is not set
# CONFIG_BT_CONTROLLER_ONLY is not set
CONFIG_BT_CONTROLLER_ENABLED=y
# CONFIG_BT_CONTROLLER_DISABLED is not set

#
# Common Options
#
CONFIG_BT_ALARM_MAX_NUM=50
CONFIG_BT_BLE_HOST_ALLOW_SUB_SPEC_MIN_CONN_INT=y
CONFIG_BT_SMP_CRYPTO_STACK_TINYCRYPT=y
# CONFIG_BT_SMP_CRYPTO_STACK_MBEDTLS is not set

#
# BT Logs
#

#
# Log Sources
#
# end of Log Sources

# CONFIG_BT_LOG_CRITICAL_ONLY is not set
# CONFIG_BLE_LOG_ENABLED is not set

#
# Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
#
# CONFIG_BT_BLE_LOG_SPI_OUT_ENABLED is not set
# end of Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
# end of BT Logs

